Repository: HogeBlekker/revpipycontrol
Catalog: revpipycontrol/locale/*/LC_MESSAGES/revpipycontrol.po
Languages: de

source: Question
de: Frage

source: Do you really want to quit? Unsaved changes will be lost
de: Wollen Sie wirklich beenden? Nicht gespeicherte Änderungen gehen verloren

source: IP access control list
de: IP Zugriffsliste

source: Existing ACLs
de: Vorhandene ACLs

source: Access level
de: Zugriffslevel

source: load entry
de: Eintrag laden

source: remove entry
de: Eintrag entfernen

source: Edit acess control list
de: Liste der Zugriffslevel bearbeiten

source: IP address
de: IP Adresse

source: add to list
de: in Liste einfügen

source: clear
de: leeren

source: Save
de: Speichern

source: Close
de: Schließen

source: Do you really want to delete the following item? IP: {0} / Level: {1}
de: Soll das Element wirklich gelöscht werden? IP: {0} / Level: {1}

source: Error
de: Fehler

source: Can not delete ACL! Check format.
de: Kann ACL nicht löschen! Format prüfen.

source: Can not load new ACL! Check format.
de: Kann neue ACL nicht laden! Format prüfen.

source: MQTT Settings
de: MQTT Einstellungen

source: MQTT base topic
de: MQTT Basistopic

source: Base topic
de: Basistopic

source: The base topic is the first part of any mqtt topic, the Revolution Pi will publish. You can use any character includig '/' to structure the messages on your broker. For example: revpi0000/data
de: Der Basetopic ist der erste Teil des Topics von jeder MQTT-Nachricht, die der Revolution Pi sendet. Es kann jedes Zeichen inkl. '/' verwendet werden um die Nachrichten auf dem Broker zu strukturieren. Zum Beispiel: revpi0000/data

source: MQTT publish settings
de: MQTT Sendeeinstellungen

source: Publish all exported values every n seconds
de: Alle exportierten Werte alle n Sekunden senden

source: Send exported values immediately on value change
de: Exportierte Werte sofort senden, wenn diese sich ändern

source: MQTT set outputs
de: MQTT setze Ausgänge

source: Allow MQTT to to set outputs on Revolution Pi
de: MQTT erlauben, Ausgänge am Revolution Pi zu setzen

source: The Revolution Pi will subscribe a topic on which your mqtt client can publish messages with the new io value as payload. Publish values with topic: [basetopic]/set/[outputname]
de: Der Revolution Pi abonniert einen Topic, über den ein MQTT-Client neue IO Werte setzen kann. Der Wert wird aus dem Payload der Nachricht entnommen Topic für publish: [basetopic]/set/[outputname]

source: MQTT broker settings
de: MQTT Brokereinstellungen

source: Broker address
de: Brokeradresse

source: Use TLS
de: Verwende TLS

source: Username
de: Benutzername

source: Password
de: Kennwort

source: Given value for Output '{0}' is not valid! Reset to '{1}'
de: Angegebener Wert für Output '{0}' ist nicht gültig! Setze auf '{1}' zurück

source: Devices of RevPi
de: Devices vom RevPi

source: Control
de: Kontrolle

source: Read all IOs
de: Lese alle IOs

source: Read just Inputs
de: Nur Inputs lesen

source: Write Outputs
de: Outputs schreiben

source: Autorefresh values
de: Aktualisiere Werte automatisch

source: Write values to RevPi
de: Schreibe Werte auf RevPi

source: Warning
de: Warnung

source: You want to set outputs on the RevPi! Note that these are set IMMEDIATELY!!! If another control program is running on the RevPi, it could interfere and reset the outputs.
de: Sie wollen Outputs auf dem RevPi setzen! Beachten Sie, dass diese SOFORT gesetzt werden!!! Wenn auf dem RevPi ein anderes Programm zur Steuerung läuft, könnte dies gestört werden und die Ausgänge wieder zurücksetzen.

source: To many errors while reading IO data. Can not show the Watch-Mode.
de: Zu viele Fehler beim Lesen der IO-Daten. Watch-Mode kann nicht angezeigt werden.

source: Error set value of device '{0}' Output '{1}': {2}
de: Fehler beim Setzen der Werte auf Device '{0}' bei Output '{1}': {2}

source: File watcher for PLC development
de: Dateiüberwachung für PLC Entwicklung

source: Path to list files:
de: Pfad für Dateiliste:

source: Select path
de: Pfad wählen

source: Stop / Upload / Start
de: Stoppen / Hochladen / Starten

source: Just upload
de: Nur hochladen

source: A PLC program has been uploaded. Please check the PLC options to see if the correct program is specified as the start program.
de: Ein PLC Programm wurde hochgeladen. Bitte prüfen Sie die PLC Optionen, ob dort das richtige Programm als Startprogramm angegeben ist.

source: The Revolution Pi could not process some parts of the transmission.
de: Der Revoluton Pi konnte Teile der Übertragung nicht verarbeiten.

source: Errors occurred during transmission
de: Bei der Übertragung traten Fehler auf

source: Directory to watch
de: Ordner zum Überwachen

source: Can not open the selected folder.
de: Kann gewählten Ordner nicht öffnen.

source: Found more than 1000 files! Only 1000 files can be shown in this dialog, all other will be ignored.
de: Mehr als 1000 Dateien gefunden! Es werden nur 1000 Dateien in diesem Dialog angezeigt, der Rest wird ignoriert.

source: RevPi Python PLC info
de: RevPi Python PLC Information

source: RevPi Python PLC - Control
de: RevPi Python PLC - Kontrollcenter

source: RevPiPyLoad version on RevPi:
de: RevPiPyLoad Version auf RevPi:

source: not conn.
de: nicht verb.

source: RevPiModIO, RevPiPyLoad and RevPiPyControl are community driven projects. They are all free and open source software. All of them comes with ABSOLUTELY NO WARRANTY, to the extent permitted by applicable law. (c) Sven Sager, License: LGPLv3
de: RevPiModIO, RevPiPyLoad und RevPiPyControl sind gemeinschaftsorientierte Projekte. Sie sind alle frei und Open Source Software. Alle kommen mit ABSOLUT KEINER GARANTIE, soweit gesetzlich zulässig. (c) Sven Sager, Lizenz: LGPLv3

source: RevPi Python PLC Options
de: RevPi Python PLC Einstellungen

source: Start / Stop behavior
de: Start / Stop Verhalten

source: Start program automatically
de: Starte Programm automatisch

source: Restart program after exit
de: Starte Programm nach Beenden neu

source: Set process image to NULL if program terminates...
de: Prozessabbild auf NULL setzen, wenn Programm...

source: ... successfully
de: ... ohne Fehler beendet

source: ... with errors
de: ... mit Fehlern beendet

source: PLC program
de: PLC Programm

source: Python PLC program name
de: Python PLC Programmname

source: Program arguments
de: Programmargumente

source: Use RevPi as PLC-Slave
de: RevPi als PLC-Slave verwenden

source: Activate XML-RPC server on RevPi
de: Aktiviere XML-RPC Server auf RevPi

source: Allow download of piCtory configuration and PLC programm
de: Download von piCtroy Konfiguration und PLC Programm zulassen

source: Allow upload of piCtory configuration and PLC programm
de: Hochladen von piCtroy Konfiguration und PLC Programm zulassen

source: You have not made any changes to save.
de: Sie haben keine Änderungen zum Speichern vorgenommen.

source: The settings are now saved on the Revolution Pi. Should the new settings take effect immediately? This means a restart of the service and the PLC program!
de: Die Einstellungen werden jetzt auf dem Revolution Pi gespeichert. Sollen die neuen Einstellungen sofort in Kraft treten? Dies bedeutet einen Neustart des Dienstes und des laufenden PLC-Programms!

source: Settings saved
de: Einstellungen gespeichert

source: The settings could not be saved. This can happen if values are wrong!
de: Die Einstellungen konnten nicht gesichert werden. Dies kann passieren, wenn Werte falsch sind!

source: Are you sure you want to deactivate the XML-RPC server? You will NOT be able to access the Revolution Pi with this program.
de: Soll der XML-RPC Server wirklich beendet werden? Sie können dann NICHT mehr mit diesem Programm auf den Revolution Pi zugreifen.

source: RevPi Python PLC Logs
de: RevPi Python PLC Logdaten

source: RevPiPyLoad - Logfile
de: RevPiPyLoad - Logdatei

source: Clear screen
de: Leere Ansicht

source: Python PLC program - Logfile
de: Python PLC Programm - Logdatei

source: Can not access log file on the RevPi
de: Auf die Logdatei des RevPi kann nicht zugegriffen werden

source: Do not use replace io file
de: Keine replace io Datei verwenden

source: Use static file from RevPiPyLoad
de: Statische Datei von RevPiPyLoad

source: Use dynamic file from work directory
de: Dynamische Datei des Steuerungsprogramms

source: Give own path and filename
de: Eigenen Pfad angeben

source: The value of 'restart delay' ist not valid.
de: Der Wert für 'Neustart Verzögerung' ist nicht gültig.

source: Restart after n seconds of delay
de: Neustart nach n Sekunden Verzögerung

source: Replace IO file:
de: Replace IO Datei:

source: Program arguments:
de: Programmargumente:

source: Set write access to workdirectory
de: Schreibzugriffe in Arbeitsverzeichnis erlauben

source: RevPiPyLoad server services
de: RevPiPyLoad Server Dienste

source: Edit ACL
de: ACL bearbeiten

source: RevPi-Slave service is:
de: RevPi-Slave Dienst Status:

source: running
de: läuft

source: stopped
de: beendet

source: MQTT process image publisher
de: MQTT Übertragung des Prozessabbilds

source: Settings
de: Einstellungen

source: MQTT publish service is:
de: MQTT Übertragungsdienst Status:

source: The settings will be set on the Revolution Pi now. If you made changes on the 'PCL Program' section, your plc program will restart! ACL changes and service settings are applied immediately.
de: Die Einstellungen werden jetzt auf dem Revolution Pi gespeichert Wenn Änderungen im Block 'PLC Programm' vorgenommen wurden, wird das PLC Programm jetzt neu starten! ACL Änderungen und Diensteinstellungen werden sofort angewandt.

source: read only
de: nur lesen

source: read and write
de: lesen und schreiben

source: Start/Stop PLC program and read logs
de: PLC Programm starten/stoppen und Logs lesen

source: + read IOs in watch modus
de: + IOs in 'Watch modus' lesen

source: + read properties and download PLC program
de: + Einstellungen lesen und PLC Programm herunterladen

source: + upload PLC program
de: + PLC Programm hochladen

source: + set properties
de: + Einstellungen ändern

source: RevPi Python PLC connections
de: RevPi Python PLC Verbindungen

source: New
de: Neu

source: Apply
de: Übernehmen

source: Remove
de: Entfernen

source: Do you really want to delete the selected connection '{0}'?
de: Wollen Sie die ausgewählte Verbindung '{0}' wirklich löschen?

source: Successfully saved. Do you want to close this window?
de: Verbindungen erfolgreich gespeichert. Möchten Sie dieses Fenster jetzt schließen?

source: Failed to save connections
de: Verbindungen konnten nicht gespeichert werden

source: RevPi Python PLC program
de: RevPi Python PLC Programm

source: PLC python program
de: PLC Python Programm

source: Files
de: Dateien

source: Zip archive
de: Zip Archiv

source: TGZ archive
de: TGZ Archiv

source: Folder
de: Verzeichnis

source: Download PLC program as:
de: PLC Programm herunterladen als:

source: include piCtory configuration
de: inkl. piCtory Konfiguration

source: Download
de: Herunterladen

source: Upload PLC program as:
de: PLC Programm hochladen als:

source: clean upload folder before upload
de: Uploadverzeichnis vor dem Upload leeren

source: includes piCtory configuration
de: enthält piCtory Konfiguration

source: Upload
de: Hochladen

source: piCtory configuration
de: piCtory Konfiguration

source: Download piCtory configuration
de: piCtory Konfiguration herunterladen

source: Upload piCtory configuration
de: piCtory Konfiguration hochladen

source: piControl0 process image
de: piControl0 Prozessabbild

source: Download process image dump
de: Prozessabbild Dump herunterladen

source: Reset piControl
de: piControl zurücksetzen

source: Execute piControlReset
de: piControlReset ausführen

source: execute
de: ausführen

source: Exit
de: Beenden

source: Save as...
de: Speichern unter...

source: piCtory config
de: piCtory Konfiguration

source: All files
de: Alle Dateien

source: Could not load and save file!
de: Datei konnte nicht geladen und gespeichert werden!

source: Success
de: Erfolgreich

source: File successfully loaded and saved.
de: Dateien erfolgreich übertragen und gespeichert.

source: Imagefiles
de: Image Dateien

source: Open piCtory file...
de: piCtory Datei öffnen...

source: Should the piControl driver be reset after uploading the piCtory configuration?
de: Soll nach dem Hochladen der piCtory Konfiguration ein Reset am piControl Treiber durchgeführt werden?

source: The transfer of the piCtory configuration and the reset of piControl have been successfully executed.
de: Die Übertragung der piCtory Konfiguration und der Reset von piControl wurden erfolgreich ausgeführt.

source: The piCtory configuration was successfully transferred.
de: Die Übertragung der piCtory Konfiguration wurde erfolgreich ausgeführt.

source: Can not process the transferred file.
de: Kann die übertragene Datei nicht verarbeiten.

source: Can not find main elements in piCtory file.
de: Kann Hauptelemente in piCtory datei nicht finden.

source: Contained devices could not be found on Revolution Pi. The configuration may be from a newer piCtory version!
de: Enthaltene Geräte konnten auf dem Revolution Pi nicht gefunden werden. Möglicherweise stammt die Konfiguration von einer neueren piCtory Version!

source: Could not load RAP catalog on Revolution Pi.
de: Konnte RAP Katalog auf dem Revolution Pi nicht laden.

source: The piCtory configuration could not be written on the Revolution Pi.
de: Die piCtory Konfiguration konnte auf dem Revolution Pi nicht geschrieben werden.

source: The piCtroy configuration has been saved successfully. An error occurred on piControl reset!
de: Die piCtroy Konfiguration wurde erfolgreich gespeichert. Beim piControl Reset trat allerdings ein Fehler auf!

source: Are you sure to reset piControl? The process image and the piBridge are interrupted !!!
de: Soll piControlReset wirklich durchgeführt werden? Das Prozessabbild und die piBridge werden dann unterbrochen!!!

source: piControl reset executed successfully
de: piControl reset wurde erfolgreich ausgeführt

source: piControl reset could not be executed successfully
de: piControl Reset konnte nicht erfolgreich durchgeführt werden

source: Directory to save
de: Verzeichnis zum speichern

source: Folder to upload
de: Verzeichnis zum Hochladen

source: Upload Zip archive...
de: Zip Archiv hochladen...

source: The specified file is not a ZIP archive.
de: Die angegebene Datei ist kein ZIP Archiv.

source: Upload TarGz archiv...
de: TarGz Archiv hochladen...

source: The specified file is not a TAR archive.
de: Die angegebene Datei ist kein TAR Archiv.

source: There was an error deleting the files on the Revolution Pi.
de: Beim Löschen der Dateien auf dem Revolution Pi ist ein Fehler aufgetreten.

source: The PLC program was transferred successfully.
de: Das PLC Programm wurde erfolgreich übertragen.

source: There is no piCtory configuration in this archive.
de: Es wurde keine piCtory Konfiguration im Archiv gefunden.

source: Connections...
de: Verbindungen...

source: Main
de: Datei

source: Visit website...
de: Webseite besuchen...

source: Help
de: Hilfe

source: PLC stop
de: PLC Stopp

source: PLC restart
de: PLC Neustart

source: PLC watch mode
de: PLC watch Modus

source: PLC options...
de: PLC Optionen...

source: PLC program...
de: PLC Programm...

source: PLC developer...
de: PLC Entwickler...

source: Disconnect
de: Trennen

source: Connect
de: Verbinden

source: The watch mode ist not supported in version {0} of RevPiPyLoad on your RevPi! You need at least version 0.5.3! Maybe the python3-revpimodio2 module is not installed on your RevPi at least version 2.0.0.
de: Der 'Watch Mode' ist nicht unterstützt in RevPiPyLoad Version {0}! Es muss mindestens Version 0.5.3 installiert sein! Stellen Sie sicher, dass auch python3-revpimodio2 auf dem RevPi installiert ist.

source: Can not load piCtory configuration. Did you create a hardware configuration? Please check this in piCtory!
de: Kann piCtory Konfiguration nicht laden Wurde eine Hardwarekonfiguration erstellt? Bitte in piCtory prüfen!

source: XML-RPC access mode in the RevPiPyLoad configuration is too small to access this dialog!
de: Der XML-RPC Modus ist beim RevPiPyLoad nicht hoch genug eingestellt, um diesen Dialog zu verwenden!

source: This version of Logviewer ist not supported in version {0} of RevPiPyLoad on your RevPi! You need at least version 0.4.1.
de: Diese Version vom Logbetrachter wird in der RevPiPyLoad Version {0} auf Ihrem RevPi nicht unterstützt! Sie benötigen mindestens Version 0.4.1.

source: Can not connect to RevPi XML-RPC Service! This could have the following reasons: The RevPi is not online, the XML-RPC service is not running or the ACL permission is not set for your IP!!!
de: Kann keine Verbindung zum RevPi XML-RPC Dienst herstellen! Das könnte folgende Gründe haben: Der RevPi ist nicht online, der XML-RPC Dienst läuft nicht oder die ACL Zugriffsberechtigung ist für diese IP nicht gesetzt!!!
